In [1]:
pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.11/dist-packages (3.5.5)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.11/dist-packages (from pyspark) (0.10.9.7)

In [12]:
from pyspark.sql import SparkSession
from pyspark.sql.functions import*

# initalize sparkContext
spark = SparkSession.builder.appName("PySpark_Tutorial").getOrCreate()
sc = spark.sparkContext
sc
# reda csv file
df=spark.read.csv("/content/sample_data/data1.csv.csv",header=True,inferSchema=True)
df.show(4)


# performe the basic oprations on datafram like rename column name we can use different way
print("rename the column")
print("withColumnRenamed()")
df.withColumnRenamed("name","fullname").show(4)
df.withColumnRenamed("age","age_number").show(4)


# selectexpr()
print("selectExpr()")
df.selectExpr("id as idnumber","name as fullname","age as age_number","gender as genderindentify","salary as money","purchased as puri","country as countires").show(4)

# Alias()
print("alias")
df.select(col("name").alias("fullname"), col("age").alias("number")).show(4)

#toDF()
print("todf()")
df.toDF("id","fullname","gen","age_number","money","pur","countries").show(4)

#add column with sepcific column using like salary
df.withColumn("bonus",col("salary")*10).show(4)


#

+---+-------+------+---+------+---------+---------+
| id|   name|gender|age|salary|purchased|  country|
+---+-------+------+---+------+---------+---------+
|  1|   John|  Male| 28| 60000|        3|      USA|
|  2|   Jane|Female| 32| 75000|        0|   Canada|
|  3|Michael|  Male| 22| 45000|        2|       UK|
|  4|  Emily|Female| 40| 90000|        1|Australia|
+---+-------+------+---+------+---------+---------+
only showing top 4 rows

rename the column
withColumnRenamed()
+---+--------+------+---+------+---------+---------+
| id|fullname|gender|age|salary|purchased|  country|
+---+--------+------+---+------+---------+---------+
|  1|    John|  Male| 28| 60000|        3|      USA|
|  2|    Jane|Female| 32| 75000|        0|   Canada|
|  3| Michael|  Male| 22| 45000|        2|       UK|
|  4|   Emily|Female| 40| 90000|        1|Australia|
+---+--------+------+---+------+---------+---------+
only showing top 4 rows

+---+-------+------+----------+------+---------+---------+
| id|   name|gender|age_number|salary|purchased|  country|
+---+-------+------+----------+------+---------+---------+
|  1|   John|  Male|        28| 60000|        3|      USA|
|  2|   Jane|Female|        32| 75000|        0|   Canada|
|  3|Michael|  Male|        22| 45000|        2|       UK|
|  4|  Emily|Female|        40| 90000|        1|Australia|
+---+-------+------+----------+------+---------+---------+
only showing top 4 rows

selectExpr()
+--------+--------+----------+---------------+-----+----+---------+
|idnumber|fullname|age_number|genderindentify|money|puri|countires|
+--------+--------+----------+---------------+-----+----+---------+
|       1|    John|        28|           Male|60000|   3|      USA|
|       2|    Jane|        32|         Female|75000|   0|   Canada|
|       3| Michael|        22|           Male|45000|   2|       UK|
|       4|   Emily|        40|         Female|90000|   1|Australia|
+--------+--------+----------+---------------+-----+----+---------+
only showing top 4 rows

alias
+--------+------+
|fullname|number|
+--------+------+
|    John|    28|
|    Jane|    32|
| Michael|    22|
|   Emily|    40|
+--------+------+
only showing top 4 rows

todf()
+---+--------+------+----------+-----+---+---------+
| id|fullname|   gen|age_number|money|pur|countries|
+---+--------+------+----------+-----+---+---------+
|  1|    John|  Male|        28|60000|  3|      USA|
|  2|    Jane|Female|        32|75000|  0|   Canada|
|  3| Michael|  Male|        22|45000|  2|       UK|
|  4|   Emily|Female|        40|90000|  1|Australia|
+---+--------+------+----------+-----+---+---------+
only showing top 4 rows

+---+-------+------+---+------+---------+---------+------+
| id|   name|gender|age|salary|purchased|  country| bonus|
+---+-------+------+---+------+---------+---------+------+
|  1|   John|  Male| 28| 60000|        3|      USA|600000|
|  2|   Jane|Female| 32| 75000|        0|   Canada|750000|
|  3|Michael|  Male| 22| 45000|        2|       UK|450000|
|  4|  Emily|Female| 40| 90000|        1|Australia|900000|
+---+-------+------+---+------+---------+---------+------+
only showing top 4 rows